Repository: zxDefine/MyBookManager
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja, ko, zh_hans, zh_hant

# BtnFind.Content
source: Find
ja: サーチ
ko: 찾다
zh_hans: 查找
zh_hant: 搜索

# BtnFind_Tip.Text
source: Find a book
ja: 本の情報をサーチします

# BtnNewBook.Content
source: Add New Book
ja: 新しい本を追加します
ko: 새 책 추가
zh_hans: 添加新的图书
zh_hant: 添加新書

# BtnNewBook_Tip.Text
source: Add a new book to the collection
ja: コレクションに新しい本を追加します

# BtnViewBook.Content
source: View Collections
ja: 本のコレクションを見ます

# BtnViewBook_Tip.Text
source: View and edit a book
ja: 本の情報の表示または編集

# Btn_Add_Book_Collection_Tip.Text
source: Create a new book collection
ja: 新しい本のコレクションを作成します
ko: 새 책 컬렉션을 만듭니다.
zh_hans: 创建一个新的图书收藏
zh_hant: 創建一個新的圖書收藏。

# Btn_Back_Tip.Text
source: Back
ja: 戻ります
ko: 뒤
zh_hans: 后退
zh_hant: 後退

# Btn_CreateBook_AddTag.Text
source: Add tag
ja: タグを追加します
zh_hans: 添加标签

# Btn_CreateBook_Delete_Last_Tag.Text
source: Delete the last registered tag
ja: 最後に追加されたタグを削除します
zh_hans: 删除最后添加的标签

# Btn_Del_Collection.Text
source: Delete the collection library
ja: コレクションを削除します

# Btn_ExportData_Tip.Text
source: Export the collection library
ja: コレクションをエクスポートします
ko: 템플릿 또는 컬렉션 라이브러리 내보내기
zh_hans: 导出收藏
zh_hant: 導出模板或收藏庫

# Btn_ImportData_Tip.Text
source: Import the collection library
ja: コレクションをインポートします
ko: 템플릿 또는 컬렉션 라이브러리 가져오기
zh_hans: 导入收藏
zh_hant: 導入模板或收藏庫

# Btn_Language_Tip.Text
source: Change the app language
ja: 言語変更
ko: 앱 언어 변경
zh_hans: 更换语言
zh_hant: 更改應用語言

# ChangeLanguageDialogTitle
source: Do you want to change the app's language?
ja: ソフトの言語を変更してもよろしいですか？
ko: 앱의 언어를 변경하시겠습니까?
zh_hans: 确定要修改软件的语言吗?
zh_hant: 您想更改應用程序的語言嗎？

# ChangeLanguageDialogTxt
source: Changing the language will restart the app. Are you sure?
ja: 表示言語を変更するとプログラムが再起動しますが、再起動してもよろしいですか？

# ChangeLanguageDialog_No
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# ChangeLanguageDialog_Yes
source: Confirm
ja: 確認

# CommAddToText.Text
source: Add to:
ja: 追加場所：
ko: 추가:
zh_hans: 添加至:
zh_hant: 添加到：

# CreateBook_AddTo.Text
source: Add the new book to the list
ja: リストに新しい本を追加します
zh_hans: 将新书添加到列表中

# CreateBook_Author.Text
source: Author
ja: 作者
zh_hans: 作者

# CreateBook_Categorys.Text
source: Categories
ja: カテゴリー

# CreateBook_Check_Save_Btn_No
source: No
ja: いいえ
zh_hans: 否

# CreateBook_Check_Save_Btn_Yes
source: Yes
ja: はい
zh_hans: 是

# CreateBook_Check_Save_Content
source: Found new additions, do you need to save?(save to XXXXXX)
ja: 新しい追加情報が見つかりました。保存する必要がありますか？（XXXXXXに保存）

# CreateBook_Check_Save_Title
source: Do you want to save?
ja: 保存してもよろしいですか？
zh_hans: 确定要保存吗?

# CreateBook_Country.Text
source: Country
ja: 国
zh_hans: 国家

# CreateBook_Country_CN
source: China
ja: 中国
zh_hans: 中国

# CreateBook_Country_DE
source: Germany
ja: ドイツ
zh_hans: 德国

# CreateBook_Country_ES
source: Spain
ja: スペイン
zh_hans: 西班牙

# CreateBook_Country_FR
source: France
ja: フランス
zh_hans: 法国

# CreateBook_Country_IT
source: Italy
ja: イタリア
zh_hans: 意大利

# CreateBook_Country_JP
source: Japan
ja: 日本
zh_hans: 日本

# CreateBook_Country_KR
source: South Korea
ja: 韓国
zh_hans: 韩国

# CreateBook_Country_OTHER
source: Other
ja: その他
zh_hans: 其他

# CreateBook_Country_PT
source: Portugal
ja: ポルトガル
zh_hans: 葡萄牙

# CreateBook_Country_RU
source: Russia
ja: ロシア
zh_hans: 俄罗斯

# CreateBook_Country_UK
source: UK
ja: イギリス

# CreateBook_Country_US
source: USA
ja: アメリカ
zh_hans: 美国

# CreateBook_CoverImage.Text
source: CoverImage
ja: カバー画像
zh_hans: 封面图片

# CreateBook_Description.Text
source: Description
ja: 説明
zh_hans: 说明

# CreateBook_Find_Same_Book_Content
source: Found the same book in the list, do you want to add the same book?
ja: 同じ本がすでにリストに存在しています。リストに追加しますか？

# CreateBook_Find_Same_Book_Title
source: Found the same book in the list
ja: リストに同じ本が存在します
zh_hans: 列表中有相同图书

# CreateBook_ISBN_Comment.Text
source: This application can automatically find book information from Google Books through the ISBN code
ja: ソフトは、ISBNコードによってGoogleBooksから本の情報を自動的に検索できます

# CreateBook_Language.Text
source: Language
ja: 言語
zh_hans: 语言

# CreateBook_Language_CN
source: Simplified Chinese
ja: 簡体字中国語
zh_hans: 简体中文

# CreateBook_Language_DE
source: German
ja: ドイツ語
zh_hans: 德语

# CreateBook_Language_EN
source: English
ja: 英語
zh_hans: 英语

# CreateBook_Language_ES
source: Spanish
ja: スペイン語
zh_hans: 西班牙语

# CreateBook_Language_FR
source: French
ja: フランス語
zh_hans: 法语

# CreateBook_Language_IT
source: Italian
ja: イタリア語
zh_hans: 意大利语

# CreateBook_Language_JP
source: Japanese
ja: 日本語
zh_hans: 日语

# CreateBook_Language_KR
source: Korean
ja: 韓国語
zh_hans: 韩语

# CreateBook_Language_Other
source: Other
ja: 他の言語
zh_hans: 其他语言

# CreateBook_Language_PT
source: Portuguese
ja: ポルトガル語
zh_hans: 葡萄牙语

# CreateBook_Language_RU
source: Russian
ja: ロシア語
zh_hans: 俄语

# CreateBook_Language_TW
source: Traditional Chinese
ja: 繁体字中国語
zh_hans: 繁体中文

# CreateBook_Not_Add_Content
source: Please add a new book
ja: 新しい本を追加してください
zh_hans: 请添加一本新的图书

# CreateBook_Not_Add_Title
source: No added
ja: 追加された本はありません。

# CreateBook_No_Save_Content
source: There are new additions, but it has not been saved. Do you want to continue?
ja: 新しい本が追加されましたが、まだ保存されていません。続行しますか？
zh_hans: 有新的图书被添加,但还没有保存,是否要继续?

# CreateBook_No_Save_Title
source: Not saved!
ja: 未保存!!

# CreateBook_Price.Text
source: Price
ja: 価格
zh_hans: 价格

# CreateBook_PublishDate.Text
source: PublishDate
ja: 発行日
zh_hans: 出版日期

# CreateBook_Publisher.Text
source: Publishers
ja: 出版社
zh_hans: 出版社

# CreateBook_Save.Text
source: Save the book list to collections
ja: 本のリストをコレクションに保存します

# CreateBook_Save_Dialog_Content
source: Are you sure you want to save the book list to XXXXXX?
ja: 本のリストをXXXXXXに保存しますか？

# CreateBook_Save_Dialog_Content_Error
source: Please type in the title
ja: 本のタイトルを入力してください!!

# CreateBook_Save_Dialog_Content_Price_Error
source: Please input a valid price
ja: これは有効な価格数字ではありません。 直してください

# CreateBook_Save_Dialog_Error_Btn
source: OK
ja: 了解
zh_hans: 好的

# CreateBook_Save_Dialog_Price_Error
source: Price Error!
ja: 価格エラー!
zh_hans: 价格错误!

# CreateBook_Save_Dialog_Title
source: Save the book list
ja: 本のリストの保存
zh_hans: 保存图书列表

# CreateBook_Save_Dialog_Title_Error
source: No Title!
ja: 本のタイトルはありません
zh_hans: 没有图书名字

# CreateBook_Subtitle.Text
source: Subtitle
ja: サブタイトル
zh_hans: 副标题

# CreateBook_Tags.Text
source: Tags
ja: タグ
zh_hans: 标签

# CreateBook_Title.Text
source: Title
ja: タイトル
zh_hans: 图书名

# CreateBook_Translator.Text
source: Translator
ja: 翻訳者
zh_hans: 翻译者

# CreateNewCollectionLabelTxt_Book
source: Please input the new collection name:
ja: 新しい本のコレクション名を入力してください：

# Dialog_Create_New_Collection.PrimaryButtonText
source: OK
ja: 新規
ko: 좋아요
zh_hans: 好的
zh_hant: 確定

# Dialog_Create_New_Collection.SecondaryButtonText
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# Dialog_Create_New_Collection.Title
source: Create a new collection
ja: 新しいコレクションを作成します
ko: 새 컬렉션 만들기
zh_hans: 新建一个收藏
zh_hant: 創建新收藏

# Dialog_Create_New_Collection_Comment.Text
source: Only numbers, characters, and underscores are allowed
ja: 入力できるのは数字、文字、アンダースコアのみです

# FindBook_Collection_Target.Text
source: Collection Target:
ja: コレクションターゲット:
zh_hans: 收藏目标:

# FindBook_Find.Text
source: Start find
ja: サーチ開始
zh_hans: 开始查找

# FindBook_Find_Coment.Text
source: For multiple keywords, separate them with Space
ja: 複数のキーワードの場合は、スペースで区切してください

# FindBook_Find_From.Text
source: Find from:
ja: サーチターゲット:
zh_hans: 查找于:

# FindBook_KeyWord.Text
source: KeyWord:
ja: キーワード:
zh_hans: 关键字:

# FindBook_Result_Total_Books.Text
source: Total found:
ja: 見つかった本の数:

# Import_Error_Content_Cannot_Cover
source: The format of the file is incorrect and cannot be read! please re-import the file!
ja: ファイルの内容のフォーマットが正しくないため、読み取ることができません！ファイルを再インポートしてください！

# Import_Error_Content_FileName_Error
source: The file name must be "book_[id]_[CollectionFileName].json", please re-import the file!
ja: ファイル名は「book_[id]_[CollectionFileName].json」である必要があります。ファイルを再インポートしてください。

# Import_Error_Content_Id_Exist
source: The file ID already exists, please re-import the file!
ja: ファイルIDはすでに存在しています。ファイルを再インポートしてください！

# Import_Error_Content_NameID_Diff
source: The file name and file ID do not match the file name and ID in the file. please re-import the file!
ja: ファイル名とファイルIDがファイル内のファイル名とIDと一致しません。ファイルを再インポートしてください。

# Import_Error_Title
source: Import Error!!
ja: インポートエラー

# ISBNSearchRes_Btn
source: OK
ja: 了解
zh_hans: 好的

# ISBNSearchRes_No
source: Didn't find information with the ISBN of XXXXXX in Google Books
ja: Google BooksからISBN XXXXXXの本の情報を見つかりませんでした

# ISBNSearchRes_No_Title
source: Not Found
ja: 見つかりません
zh_hans: 未找到

# ISBNSearchRes_Yes
source: Found the book information
ja: 本の情報を見つかりました
zh_hans: 查找图书信息

# ISBNSearchRes_Yes_Title
source: Found
ja: 見つかりました
zh_hans: 找到

# MainPage_Del_Collection.PrimaryButtonText
source: Delete
ja: 削除

# MainPage_Del_Collection.SecondaryButtonText
source: Cancel
ja: キャンセル

# MainPage_Del_Collection.Title
source: Delete Collection Library
ja: これクッションを削除します

# MainPage_Del_Collection_Alarm_Content
source: Are you sure to delete the collection XXXXXX?
ja: XXXXXXを削除します、よろしいですか？

# MainPage_Del_Collection_Alarm_Title
source: Delete The Collection
ja: コレクション削除

# MainPage_Del_Collection_Content.Text
source: Please select the collection that you want to delete it
ja: 削除したいコレクションを選択してください。

# ViewBook_Btn_Edit.Text
source: Edit
ja: 編集

# ViewBook_Check_Save_Btn_No
source: No
ja: いいえ
zh_hans: 否

# ViewBook_Check_Save_Btn_Yes
source: Yes
ja: はい
zh_hans: 是

# ViewBook_Check_Save_Content
source: Found new edits, do you need to save?(save to XXXXXX)
ja: 新しい変更情報が見つかりました。保存しますか？（XXXXXXに保存）

# ViewBook_Check_Save_Title
source: Do you want to save?
ja: 保存しますか？
zh_hans: 是否要保存?

# ViewBook_CurrentBookCollection.Text
source: Current book collection:
ja: 現在本のコレクション:
zh_hans: 当前的图书收藏:

# ViewBook_Del_Book_Del_Alarm_Content
source: Are you sure you want to delete the book 「XXXXXX」?
ja: 「XXXXXX」という本を削除してもよろしいですか？

# ViewBook_Del_Book_Del_Alarm_Title
source: Delete Book
ja: 本の削除

# ViewBook_Del_Book_No_Select_Content
source: Please select the book you want to delete
ja: 削除したい本を選択してください

# ViewBook_Del_Book_No_Select_Title
source: No Selected Book!!
ja: 選択された本はありません

# ViewBook_Del_The_Book.Text
source: Delete the book info
ja: 本の情報を削除します

# ViewBook_Edit_Dialog.PrimaryButtonText
source: Save
ja: 保存
zh_hans: 保存

# ViewBook_Edit_Dialog.SecondaryButtonText
source: Cancel
ja: キャンセル
zh_hans: 取消

# ViewBook_Edit_Dialog.Title
source: Edit
ja: 編集
zh_hans: 编辑它

# ViewBook_Edit_Title_Author
source: Please edit the author
ja: 本の作者を編集してください

# ViewBook_Edit_Title_Categorys
source: Please edit the category
ja: 本のカテゴリーを編集してください

# ViewBook_Edit_Title_Country
source: Please edit the country
ja: 本の国を編集してください

# ViewBook_Edit_Title_Description
source: Please edit the description
ja: 本の説明を編集してください

# ViewBook_Edit_Title_ISBN
source: Please edit the ISBN code
ja: 本のISBNを編集してください

# ViewBook_Edit_Title_Languages
source: Please edit the languages
ja: 本の言語を編集してください

# ViewBook_Edit_Title_Price
source: Please edit the price
ja: 本の価格を編集してください

# ViewBook_Edit_Title_PublishDate
source: Please edit the publish date
ja: 本の発行日を編集してください

# ViewBook_Edit_Title_Publishers
source: Please edit the publishers
ja: 本の出版社を編集してください

# ViewBook_Edit_Title_Subtitle
source: Please edit the subtitle
ja: 本のサブタイトルを編集してください

# ViewBook_Edit_Title_Tags
source: Please edit the tags
ja: 本のタグを編集してください

# ViewBook_Edit_Title_Title
source: Please edit the title
ja: 本のタイトルを編集してください

# ViewBook_Edit_Title_Translator
source: Please edit the translator of the book
ja: 本の翻訳者を編集してください
zh_hans: 请编辑图书的翻译者

# ViewBook_List_Change_Save_Content
source: There are unsaved changes, do you want to continue?
ja: 保存されていない新しい編集があります。続行しますか？

# ViewBook_No_Book_Update_Content
source: It cannot be saved because no book information has been updated
ja: 本の編集がされていないため、保存できませんでした
zh_hans: 无法保存,因为没有图书被编辑

# ViewBook_No_Book_Update_Title
source: No book info has been updated!!
ja: 編集された本はありません
zh_hans: 没有图书被编辑

# ViewBook_No_Save_Content
source: There are unsaved changes, do you want to continue?
ja: 新しい編集されたところがありますが、まだ保存されていません。続行しますか？

# ViewBook_Save_The_Book.Text
source: Save the book info
ja: 本の情報を保存します

# ViewBook_TotalItem.Text
source: Total Books:
ja: 本の数:
zh_hans: 总图书:

# BtnFind_Tip.Text
source: Find books
ko: 모든 게임과 책을 찾으십시오.
zh_hans: 查找图书信息
zh_hant: 查找所有遊戲和書籍。

# BtnNewBook_Tip.Text
source: Add a new book to the book collection
ko: 책 컬렉션에 새 책을 추가합니다.
zh_hans: 添加新的图书到收藏里面
zh_hant: 將一本新書添加到圖書收藏中。

# BtnViewBook.Content
source: View Book Collections
ko: 도서 컬렉션 보기
zh_hans: 查看图书收藏
zh_hant: 查看圖書收藏

# BtnViewBook_Tip.Text
source: View and edit a book info of the book collections
ko: 도서 컬렉션의 도서 정보를 보고 편집합니다.
zh_hans: 查看或者编辑图书信息
zh_hant: 查看和編輯圖書收藏的圖書信息。

# Btn_Help_Tip.Text
source: Help
ko: 돕다
zh_hans: 帮助
zh_hant: 幫助

# ChangeLanguageDialogTxt
source: Changing the language will restart the app. Are you sure to restart?
ko: 언어를 변경하면 앱이 다시 시작됩니다. 다시 시작하시겠습니까?
zh_hans: 变更显示语言会重启程序,确定要重启吗?
zh_hant: 更改語言將重新啟動應用程序。 確定重啟？

# ChangeLanguageDialog_Yes
source: Sure
ko: 예
zh_hans: 确认
zh_hant: 是的

# CreateBook_Categorys.Text
source: Categorys
zh_hans: 分类

# CreateBook_Check_Save_Content
source: Found that there are new additions, do you need to save?(save to XXXXXX)
zh_hans: 发现有新的添加信息,是否需要保存?(保存到XXXXXX)

# CreateBook_Country_UK
source: U.K
zh_hans: 英国

# CreateBook_Find_Same_Book_Content
source: Found the same book in the list, Are you sure you want to add the same book?
zh_hans: 发现列表中已经有相同的图书,是否继续添加到列表中?

# CreateBook_ISBN_Comment.Text
source: The application can automatically find book information from the Google Books through the ISBN code
zh_hans: 软件可以自动通过ISBN码从GoogleBooks上寻找图书的信息

# CreateBook_Not_Add_Title
source: No New Book!
zh_hans: 没有新添加图书

# CreateBook_No_Save_Title
source: No Save!!
zh_hans: 未保存!!

# CreateBook_Save.Text
source: Save the book list to collection file
zh_hans: 保存图书列表到收藏

# CreateBook_Save_Dialog_Content
source: Are you sure you want to save the book list to XXXXXX
zh_hans: 是否要保存图书列表到XXXXXX?

# CreateBook_Save_Dialog_Content_Error
source: Please input the book title!!
zh_hans: 请输入图书名字!!

# CreateBook_Save_Dialog_Content_Price_Error
source: This is not a valid price figure. Please fix it
zh_hans: 这不是一个有效的价格数字。 请修复它

# CreateNewCollectionLabelTxt_Book
source: Please input the new book collection name:
ko: 새 책 컬렉션 이름을 입력하세요.
zh_hans: 请输入新的图书收藏名称:
zh_hant: 請輸入新的圖書收藏名稱：

# Dialog_Create_New_Collection_Comment.Text
source: Only numbers, characters, and underscores
ko: 숫자, 문자 및 밑줄만 사용할 수 있습니다.
zh_hans: 只能输入数字,字符以及下划线
zh_hant: 只能輸入數字、字符和下劃線。

# FindBook_Find_Coment.Text
source: For multiple keywords, separate them with spaces
zh_hans: 复数个关键字的话,请用空格分隔它们

# FindBook_Result_Total_Books.Text
source: Find Res Totle:
zh_hans: 总共找到图书:

# ISBNSearchRes_No
source: Not found the book information with an ISBN of XXXXXX in Google Books
zh_hans: 没有从Google Books上找到关于ISBN XXXXXX的图书信息

# ViewBook_Btn_Edit.Text
source: Edit it
zh_hans: 编辑它

# ViewBook_Check_Save_Content
source: Found that there are new updates, do you need to save?(save to XXXXXX)
zh_hans: 发现有新的修改信息,是否要保存?(保存到XXXXXX)

# ViewBook_Edit_Title_Author
source: Please edit the author of the book
zh_hans: 请编辑图书的作者

# ViewBook_Edit_Title_Categorys
source: Please edit the categorys of the book
zh_hans: 请编辑图书的分类

# ViewBook_Edit_Title_Country
source: Please edit the country of the book
zh_hans: 请编辑图书的国家

# ViewBook_Edit_Title_Description
source: Please edit the description of the book
zh_hans: 请编辑图书的说明

# ViewBook_Edit_Title_ISBN
source: Please edit the ISBN code of the book
zh_hans: 请编辑图书的ISBN

# ViewBook_Edit_Title_Languages
source: Please edit the languages of the book
zh_hans: 请编辑图书的语言

# ViewBook_Edit_Title_Price
source: Please edit the price of the book
zh_hans: 请编辑图书的价格

# ViewBook_Edit_Title_PublishDate
source: Please edit the publish date of the book
zh_hans: 请编辑图书的出版日期

# ViewBook_Edit_Title_Publishers
source: Please edit the publishers of the book
zh_hans: 请编辑图书的出版社

# ViewBook_Edit_Title_Subtitle
source: Please edit the subtitle of the book
zh_hans: 请编辑图书的副标题

# ViewBook_Edit_Title_Tags
source: Please edit the tags of the book
zh_hans: 请编辑图书的标签

# ViewBook_Edit_Title_Title
source: Please edit the title of the book
zh_hans: 请编辑图书的名字

# ViewBook_List_Change_Save_Content
source: There are unsaved changes, Do you want to continue?
zh_hans: 发现有新的编辑未保存,是否要继续?

# ViewBook_No_Save_Content
source: There are new updates, but it has not been saved. Do you want to continue?
zh_hans: 有新的图书被编辑,但还没有被保存,是否要继续?
